Reports/АР17_ФинансовыеПаказатели2017.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>АР17_ФинансовыеПаказатели2017</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыделенныеКонтрагенты</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыделятьКредиторов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Таблица</Name>
					<Type>
						<v8:Type>mxl:SpreadsheetDocument</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоДолжники</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/АР_УниверсальныйРегистр.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>АР_УниверсальныйРегистр</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗначения</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АР_СвойстваУниверсальногоРегистра</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.АР_СвойстваУниверсальногоРегистра</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АР_СтатусыОбъектовАренды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>АР_СтатусыОбъектовАренды</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачалаАренды</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияАренды</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АР_СтатусыОбъектовАренды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_Счетчики</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентОтнесенияСчетчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Начисление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_Начисления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Акт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаУслуг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ГруппыУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Депозит</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектАренды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаключениеДоговора</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_ЗаключениеДоговораАренды</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_ИзменениеСтатусовОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтрокиТЧ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/АР_РасчетыПоДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>АР_РасчетыПоДоговорам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаУслуг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ГруппыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРасчетов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_ПроведениеДоговораАренды</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКорректироватьСтоимостьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Reports/АР17_ФинансовыеПаказатели2017/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Сформировать(Команда)
	
	Объект.ВыделенныеКонтрагенты = ВыделенныеКонтрагенты;
	
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	//проверки
	Если Не ЗначениеЗаполнено(Объект.ИК)Тогда
		Сообщить("Необходимо указать имущественный комплекс!");
		Возврат;
	КонецЕсли; 
	
	Если Месяц = "" Тогда
		Сообщить("Необходимо указать период!");
		Возврат;
	КонецЕсли;	
	
	//запросы +
	
	ЗапросПлощади ="ВЫБРАТЬ
	               |	ВЫРАЗИТЬ(АР_УниверсальныйРегистр.Объект КАК Справочник.АР_ОбъектыАренды) КАК ОбъектАрендыИК
	               |ПОМЕСТИТЬ ОбъектыИК
	               |ИЗ
	               |	РегистрСведений.АР_УниверсальныйРегистр КАК АР_УниверсальныйРегистр
				   |ГДЕ
				   |	АР_УниверсальныйРегистр.Значение = &ИК
				   |	И АР_УниверсальныйРегистр.ТипЗначения = &ТипЗначения
				   |	И ВЫРАЗИТЬ(АР_УниверсальныйРегистр.Объект КАК Справочник.АР_ОбъектыАренды).ТипОбъекта = &ТипОбъектаПомещение				   
				   |
				   |ИНДЕКСИРОВАТЬ ПО
				   |	ОбъектАрендыИК
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	АР_СтатусыОбъектовАренды.ДатаНачалаАренды,
	               |	АР_СтатусыОбъектовАренды.ДатаОкончанияАренды,
	               |	АР_СтатусыОбъектовАренды.ОбъектАренды,
	               |	АР_СтатусыОбъектовАренды.Договор
	               |ПОМЕСТИТЬ СтатусыОбъектов
	               |ИЗ
	               |	ОбъектыИК КАК ОбъектыИК
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АР_СтатусыОбъектовАренды КАК АР_СтатусыОбъектовАренды
	               |		ПО ОбъектыИК.ОбъектАрендыИК = АР_СтатусыОбъектовАренды.ОбъектАренды
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МИНИМУМ(СтатусыОбъектов.ДатаНачалаАренды) КАК ДатаНачалаАренды,
	               |	МАКСИМУМ(СтатусыОбъектов.ДатаОкончанияАренды) КАК ДатаОкончанияАренды,
	               |	СтатусыОбъектов.ОбъектАренды,
	               |	СтатусыОбъектов.Договор
	               |ПОМЕСТИТЬ ДействиеПоДоговорам
	               |ИЗ
	               |	СтатусыОбъектов КАК СтатусыОбъектов
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СтатусыОбъектов.ОбъектАренды,
	               |	СтатусыОбъектов.Договор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ДействиеПоДоговорам.ОбъектАренды.ЗначениеХарактеристики) КАК ПлощадьСданыхЗаОтчПериод
	               |ПОМЕСТИТЬ СданоЗаОтчПериод
	               |ИЗ
	               |	ДействиеПоДоговорам КАК ДействиеПоДоговорам
	               |ГДЕ
	               |	ДействиеПоДоговорам.ДатаНачалаАренды МЕЖДУ &НачалоПериода И &КонецПериода
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МИНИМУМ(СтатусыОбъектов.ДатаНачалаАренды) КАК ДатаНачалаАренды,
	               |	МАКСИМУМ(СтатусыОбъектов.ДатаОкончанияАренды) КАК ДатаОкончанияАренды,
	               |	СтатусыОбъектов.ОбъектАренды
	               |ПОМЕСТИТЬ ДействиеПоПомещениям
	               |ИЗ
	               |	СтатусыОбъектов КАК СтатусыОбъектов
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СтатусыОбъектов.ОбъектАренды
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ДействиеПоПомещениям.ОбъектАренды.ЗначениеХарактеристики) КАК ПлощадьСданных
	               |ПОМЕСТИТЬ Сданные
	               |ИЗ
	               |	ДействиеПоПомещениям КАК ДействиеПоПомещениям
	               |ГДЕ
	               |	(ДействиеПоПомещениям.ДатаОкончанияАренды > &КонецПериода
	               |				И ДействиеПоПомещениям.ДатаНачалаАренды < &НачалоПериода
	               |			ИЛИ ДействиеПоПомещениям.ДатаНачалаАренды МЕЖДУ &НачалоПериода И &КонецПериода)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕстьNull(Сданные.ПлощадьСданных, 0) Как ПлощадьСданных,
	               |	ЕстьNull(СданоЗаОтчПериод.ПлощадьСданыхЗаОтчПериод, 0) Как ПлощадьСданыхЗаОтчПериод
	               |ИЗ
	               |	Сданные КАК Сданные,
	               |	СданоЗаОтчПериод КАК СданоЗаОтчПериод";	
	
	ОсновнойЗапрос =
	
	"ВЫБРАТЬ Разрешенные
	|	АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	АР17_ЗаключениеДоговораАренды.Контрагент КАК Контрагент,
	|	АР17_ЗаключениеДоговораАренды.СуммаЗалога КАК СуммаЗалога
	|ПОМЕСТИТЬ Договоры
	|ИЗ
	|	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
	|ГДЕ
	|	АР17_ЗаключениеДоговораАренды.Проведен
	|	И АР17_ЗаключениеДоговораАренды.ИК = &ИК
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорКонтрагента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АР_РасчетыПоДоговорамОстаткиИОбороты.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|	АР_РасчетыПоДоговорамОстаткиИОбороты.СуммаРасход КАК СуммаРасход,
	|	ВЫБОР
	|		КОГДА &ТолькоДолжники
	|			ТОГДА ВЫБОР
	|					КОГДА АР_РасчетыПоДоговорамОстаткиИОбороты.СуммаКонечныйОстаток > 0
	|						ТОГДА АР_РасчетыПоДоговорамОстаткиИОбороты.СуммаКонечныйОстаток
	|				КОНЕЦ
	|		ИНАЧЕ АР_РасчетыПоДоговорамОстаткиИОбороты.СуммаКонечныйОстаток
	|	КОНЕЦ КАК СуммаКонечныйОстаток,
	|	Договоры.ДоговорКонтрагента КАК ДоговорКонтрагента
	|ПОМЕСТИТЬ ОстаткиИОплаты
	|ИЗ
	|	РегистрНакопления.АР_РасчетыПоДоговорам.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Месяц, , ) КАК АР_РасчетыПоДоговорамОстаткиИОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Договоры КАК Договоры
	|		ПО АР_РасчетыПоДоговорамОстаткиИОбороты.ДоговорКонтрагента = Договоры.ДоговорКонтрагента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АР_РасчетыПоДоговорам.Регистратор КАК Регистратор,
	|	Договоры.ДоговорКонтрагента КАК ДоговорКонтрагента
	|ПОМЕСТИТЬ Реализации
	|ИЗ
	|	РегистрНакопления.АР_РасчетыПоДоговорам КАК АР_РасчетыПоДоговорам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Договоры КАК Договоры
	|		ПО АР_РасчетыПоДоговорам.ДоговорКонтрагента = Договоры.ДоговорКонтрагента
	|ГДЕ
	|	АР_РасчетыПоДоговорам.Период <= &КонецПериода
	|	И АР_РасчетыПоДоговорам.Период >= &НачалоПериода
	|	И АР_РасчетыПоДоговорам.ВидДвижения = &ВидДвиженияПриход
	|	И ТИПЗНАЧЕНИЯ(АР_РасчетыПоДоговорам.Регистратор) = &ТипРТУ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугУслуги.Сумма КАК Сумма,
	|	Реализации.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугУслуги.Номенклатура.АР_ПостояннаяЧастьОплаты
	|			ТОГДА ""Пост""
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РеализацияТоваровУслугУслуги.Номенклатура.АР_КоммунальныеУслуги
	|					ТОГДА ""КУ""
	|				ИНАЧЕ ""Перем""
	|			КОНЕЦ
	|	КОНЕЦ КАК ВидНоменклатуры
	|ПОМЕСТИТЬ РеализованныеУслуги
	|ИЗ
	|	Реализации КАК Реализации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	|		ПО Реализации.Регистратор = РеализацияТоваровУслугУслуги.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугАгентскиеУслуги.Сумма,
	|	Реализации.ДоговорКонтрагента,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугАгентскиеУслуги.Номенклатура.АР_ПостояннаяЧастьОплаты
	|			ТОГДА ""Пост""
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РеализацияТоваровУслугАгентскиеУслуги.Номенклатура.АР_КоммунальныеУслуги
	|					ТОГДА ""КУ""
	|				ИНАЧЕ ""Перем""
	|			КОНЕЦ
	|	КОНЕЦ
	|ИЗ
	|	Реализации КАК Реализации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
	|		ПО Реализации.Регистратор = РеализацияТоваровУслугАгентскиеУслуги.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорКонтрагента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализованныеУслуги.Сумма КАК Пост,
	|	0 КАК Перем,
	|	0 КАК Ку,
	|	РеализованныеУслуги.ДоговорКонтрагента КАК ДоговорКонтрагента
	|ПОМЕСТИТЬ РеализованныеУслуги1
	|ИЗ
	|	РеализованныеУслуги КАК РеализованныеУслуги
	|ГДЕ
	|	РеализованныеУслуги.ВидНоменклатуры = ""Пост""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	0,
	|	РеализованныеУслуги.Сумма,
	|	0,
	|	РеализованныеУслуги.ДоговорКонтрагента
	|ИЗ
	|	РеализованныеУслуги КАК РеализованныеУслуги
	|ГДЕ
	|	РеализованныеУслуги.ВидНоменклатуры = ""Перем""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	0,
	|	0,
	|	РеализованныеУслуги.Сумма,
	|	РеализованныеУслуги.ДоговорКонтрагента
	|ИЗ
	|	РеализованныеУслуги КАК РеализованныеУслуги
	|ГДЕ
	|	РеализованныеУслуги.ВидНоменклатуры = ""КУ""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Договоры.ДоговорКонтрагента КАК ДоговорКонтрагента
	|ПОМЕСТИТЬ ДоговораБезРТУ
	|ИЗ
	|	Договоры КАК Договоры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Реализации КАК Реализации
	|		ПО Договоры.ДоговорКонтрагента = Реализации.ДоговорКонтрагента
	|ГДЕ
	|	Реализации.ДоговорКонтрагента ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоговораБезРТУ.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	АР17_ПроведениеДоговораАренды.Ссылка КАК ПроведениеДоговораАренды
	|ПОМЕСТИТЬ УслугиПоДоговору1
	|ИЗ
	|	ДоговораБезРТУ КАК ДоговораБезРТУ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ПроведениеДоговораАренды КАК АР17_ПроведениеДоговораАренды
	|		ПО ДоговораБезРТУ.ДоговорКонтрагента = АР17_ПроведениеДоговораАренды.ДоговорКонтрагента
	|ГДЕ
	|	АР17_ПроведениеДоговораАренды.Дата >= &НачалоПериода
	|	И АР17_ПроведениеДоговораАренды.Дата <= &КонецПериода
	|	И АР17_ПроведениеДоговораАренды.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АР17_ПроведениеДоговораАрендыУслуги.Сумма КАК Сумма,
	|	УслугиПоДоговору1.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВЫБОР
	|		КОГДА АР17_ПроведениеДоговораАрендыУслуги.Номенклатура.АР_ПостояннаяЧастьОплаты
	|			ТОГДА ""Пост""
	|		ИНАЧЕ ВЫБОР
	|				КОГДА АР17_ПроведениеДоговораАрендыУслуги.Номенклатура.АР_КоммунальныеУслуги
	|					ТОГДА ""КУ""
	|				ИНАЧЕ ""Перем""
	|			КОНЕЦ
	|	КОНЕЦ КАК ВидНоменклатуры
	|ПОМЕСТИТЬ УслугиПоДоговору2
	|ИЗ
	|	УслугиПоДоговору1 КАК УслугиПоДоговору1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ПроведениеДоговораАренды.Услуги КАК АР17_ПроведениеДоговораАрендыУслуги
	|		ПО УслугиПоДоговору1.ПроведениеДоговораАренды = АР17_ПроведениеДоговораАрендыУслуги.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УслугиПоДоговору2.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	УслугиПоДоговору2.Сумма КАК Пост,
	|	0 КАК Перем,
	|	0 КАК КУ
	|ПОМЕСТИТЬ УслугиПоДоговору3
	|ИЗ
	|	УслугиПоДоговору2 КАК УслугиПоДоговору2
	|ГДЕ
	|	УслугиПоДоговору2.ВидНоменклатуры = ""Пост""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УслугиПоДоговору2.ДоговорКонтрагента,
	|	0,
	|	УслугиПоДоговору2.Сумма,
	|	0
	|ИЗ
	|	УслугиПоДоговору2 КАК УслугиПоДоговору2
	|ГДЕ
	|	УслугиПоДоговору2.ВидНоменклатуры = ""Перем""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УслугиПоДоговору2.ДоговорКонтрагента,
	|	0,
	|	0,
	|	УслугиПоДоговору2.Сумма
	|ИЗ
	|	УслугиПоДоговору2 КАК УслугиПоДоговору2
	|ГДЕ
	|	УслугиПоДоговору2.ВидНоменклатуры = ""КУ""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализованныеУслуги1.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	СУММА(РеализованныеУслуги1.Пост) КАК Пост,
	|	СУММА(РеализованныеУслуги1.Перем) КАК Перем,
	|	СУММА(РеализованныеУслуги1.Ку) КАК Ку
	|ПОМЕСТИТЬ РеализованныеУслугиПоДоговору
	|ИЗ
	|	РеализованныеУслуги1 КАК РеализованныеУслуги1
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализованныеУслуги1.ДоговорКонтрагента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УслугиПоДоговору3.ДоговорКонтрагента,
	|	СУММА(УслугиПоДоговору3.Пост),
	|	СУММА(УслугиПоДоговору3.Перем),
	|	СУММА(УслугиПоДоговору3.КУ)
	|ИЗ
	|	УслугиПоДоговору3 КАК УслугиПоДоговору3
	|
	|СГРУППИРОВАТЬ ПО
	|	УслугиПоДоговору3.ДоговорКонтрагента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА &ТолькоДолжники
	|			ТОГДА ВЫБОР
	|					КОГДА ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток > 0
	|						ТОГДА ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток
	|				КОНЕЦ
	|		ИНАЧЕ ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток
	|	КОНЕЦ КАК ДепозитНаНачалоПоБУ,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт КАК ОплатаДепозита,
	|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток КАК ДепозитНаКонецПоБУ,
	|	ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Субконто2 КАК Справочник.ДоговорыКонтрагентов) КАК ДоговорКонтрагента,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт КАК НачислениеДепозита
	|ПОМЕСТИТЬ Депозиты
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Месяц,
	|			,
	|			Счет.Код = ""62.04""
	|				ИЛИ Счет.Код = ""76.09.1"",
	|			,
	|			) КАК ХозрасчетныйОстаткиИОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Договоры КАК Договоры
	|		ПО ХозрасчетныйОстаткиИОбороты.Субконто2 = Договоры.ДоговорКонтрагента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток КАК ПениНаНачалоПоБУ,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт КАК ОплатаПени,
	|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток КАК ПениНаКонецПоБУ,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт КАК НачислениеПени,
	|	ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Субконто2 КАК Справочник.ДоговорыКонтрагентов) КАК ДоговорКонтрагента
	|ПОМЕСТИТЬ Пени
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Месяц, , Счет.Код = ""76.02"", , ) КАК ХозрасчетныйОстаткиИОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Договоры КАК Договоры
	|		ПО ХозрасчетныйОстаткиИОбороты.Субконто2 = Договоры.ДоговорКонтрагента";
	
	ЗапросДетализацияВоВремТаблицу =
	
	";
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ЕСТЬNULL(Пени.ПениНаНачалоПоБУ, 0)) КАК ПениНаНачалоПоБУ,
	|	СУММА(ЕСТЬNULL(Пени.ОплатаПени, 0)) КАК ОплатаПени,
	|	СУММА(ЕСТЬNULL(Пени.ПениНаКонецПоБУ, 0)) КАК ПениНаКонецПоБУ,
	|	СУММА(ЕСТЬNULL(Пени.НачислениеПени, 0)) КАК ПениНачислено,
	|	СУММА(ЕСТЬNULL(РеализованныеУслугиПоДоговору.Пост, 0)) КАК Пост,
	|	СУММА(ЕСТЬNULL(РеализованныеУслугиПоДоговору.Перем, 0)) КАК Перем,
	|	СУММА(ЕСТЬNULL(РеализованныеУслугиПоДоговору.Ку, 0)) КАК КУ,
	|	СУММА(ЕСТЬNULL(ОстаткиИОплаты.СуммаНачальныйОстаток, 0)) КАК СуммаНачальныйОстаток,
	|	СУММА(ЕСТЬNULL(ОстаткиИОплаты.СуммаРасход, 0)) КАК СуммаРасход,
	|	СУММА(ЕСТЬNULL(ОстаткиИОплаты.СуммаКонечныйОстаток, 0)) КАК СуммаКонечныйОстаток,
	|	СУММА(ЕСТЬNULL(Депозиты.ДепозитНаНачалоПоБУ, 0) + Договоры.СуммаЗалога) КАК ДепозитНаНачало,
	|	СУММА(ЕСТЬNULL(Депозиты.ОплатаДепозита, 0)) КАК ОплатаДепозита,
	|	СУММА(ЕСТЬNULL(Депозиты.НачислениеДепозита, 0)) КАК НачислениеДепозита,
	
	//|	СУММА(ЕСТЬNULL(Депозиты.ДепозитНаКонецПоБУ, 0) + Договоры.СуммаЗалога) КАК ДепозитНаКонец,
	|СУММА(ВЫБОР
	|		КОГДА &ТолькоДолжники
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(Депозиты.ДепозитНаКонецПоБУ, 0) + Договоры.СуммаЗалога > 0
	|						ТОГДА ЕСТЬNULL(Депозиты.ДепозитНаКонецПоБУ, 0) + Договоры.СуммаЗалога
	|				КОНЕЦ
	|		ИНАЧЕ ЕСТЬNULL(Депозиты.ДепозитНаКонецПоБУ, 0) + Договоры.СуммаЗалога
	|	КОНЕЦ) КАК ДепозитНаКонец,

	|	СУММА(Договоры.СуммаЗалога) КАК СуммаЗалога,
	|	Договоры.Контрагент
	|ПОМЕСТИТЬ ДетальныеЗаписи
	|ИЗ
	|	Договоры КАК Договоры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиИОплаты КАК ОстаткиИОплаты
	|		ПО Договоры.ДоговорКонтрагента = ОстаткиИОплаты.ДоговорКонтрагента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РеализованныеУслугиПоДоговору КАК РеализованныеУслугиПоДоговору
	|		ПО Договоры.ДоговорКонтрагента = РеализованныеУслугиПоДоговору.ДоговорКонтрагента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Депозиты КАК Депозиты
	|		ПО Договоры.ДоговорКонтрагента = Депозиты.ДоговорКонтрагента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Пени КАК Пени
	|		ПО Договоры.ДоговорКонтрагента = Пени.ДоговорКонтрагента
	|
	|СГРУППИРОВАТЬ ПО
	|	Договоры.Контрагент";
	
	ЗапросПоКонкретным =
	
	";
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДетальныеЗаписи.ПениНаНачалоПоБУ,
	|	ДетальныеЗаписи.ОплатаПени,
	|	ДетальныеЗаписи.ПениНаКонецПоБУ,
	|	ДетальныеЗаписи.ПениНачислено,
	|	ДетальныеЗаписи.Пост,
	|	ДетальныеЗаписи.Перем,
	|	ДетальныеЗаписи.КУ,
	|	ДетальныеЗаписи.СуммаНачальныйОстаток,
	|	ДетальныеЗаписи.СуммаРасход,
	|	ДетальныеЗаписи.СуммаКонечныйОстаток,
	|	ДетальныеЗаписи.ДепозитНаНачало,
	|	ДетальныеЗаписи.ОплатаДепозита,
	|	ДетальныеЗаписи.НачислениеДепозита,
	|	ДетальныеЗаписи.ДепозитНаКонец,
	|	ДетальныеЗаписи.СуммаЗалога,
	|	ДетальныеЗаписи.Контрагент
	|ИЗ
	|	ДетальныеЗаписи КАК ДетальныеЗаписи
	|ГДЕ
	|	(ДетальныеЗаписи.Контрагент В (&МассивКА)
	|			ИЛИ (ДетальныеЗаписи.СуммаНачальныйОстаток > 0
	|				ИЛИ ДетальныеЗаписи.СуммаКонечныйОстаток > 0))";
	
	ЗапросГруппировка = 
	
	";
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ДетальныеЗаписи.ПениНаНачалоПоБУ) КАК ПениНаНачалоПоБУ,
	|	СУММА(ДетальныеЗаписи.ОплатаПени) КАК ОплатаПени,
	|	СУММА(ДетальныеЗаписи.ПениНаКонецПоБУ) КАК ПениНаКонецПоБУ,
	|	СУММА(ДетальныеЗаписи.ПениНачислено) КАК ПениНачислено,
	|	СУММА(ДетальныеЗаписи.Пост) КАК Пост,
	|	СУММА(ДетальныеЗаписи.Перем) КАК Перем,
	|	СУММА(ДетальныеЗаписи.КУ) КАК КУ,
	|	СУММА(ДетальныеЗаписи.СуммаНачальныйОстаток) КАК СуммаНачальныйОстаток,
	|	СУММА(ДетальныеЗаписи.СуммаРасход) КАК СуммаРасход,
	|	СУММА(ДетальныеЗаписи.СуммаКонечныйОстаток) КАК СуммаКонечныйОстаток,
	|	СУММА(ДетальныеЗаписи.ДепозитНаНачало) КАК ДепозитНаНачало,
	|	СУММА(ДетальныеЗаписи.ОплатаДепозита) КАК ОплатаДепозита,
	|	СУММА(ДетальныеЗаписи.НачислениеДепозита) КАК НачислениеДепозита,
	|	СУММА(ДетальныеЗаписи.ДепозитНаКонец) КАК ДепозитНаКонец,
	|	СУММА(ДетальныеЗаписи.СуммаЗалога) КАК СуммаЗалога
	|ИЗ
	|	ДетальныеЗаписи КАК ДетальныеЗаписи
	|ГДЕ
	|	(НЕ ДетальныеЗаписи.Контрагент В (&МассивКА)
	|			ИЛИ ДетальныеЗаписи.СуммаНачальныйОстаток < 0
	|			ИЛИ ДетальныеЗаписи.СуммаКонечныйОстаток < 0)";

	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ТипОбъектаПомещение", Справочники.АР_ТипыОбъектовАренды.Помещение);
	Запрос.УстановитьПараметр("ВидДвиженияПриход", ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("ИК", Объект.ИК);
	Запрос.УстановитьПараметр("КонецПериода", Объект.ОкончаниеПериода);
	Запрос.УстановитьПараметр("НачалоПериода", Объект.НачалоПериода);
	Запрос.УстановитьПараметр("ТипРТУ", Тип("ДокументСсылка.РеализацияТоваровУслуг"));
	Запрос.УстановитьПараметр("ТипЗначения", ПланыВидовХарактеристик.АР_СвойстваУниверсальногоРегистра.ИмущественныйКомплекс);
	
	Запрос.УстановитьПараметр("ТолькоДолжники",Объект.ТолькоДолжники); // + NAI Becar Комментирование Смирнов А.А. от 05.07.2018 15:20
	
	Если Объект.ВыделенныеКонтрагенты.Количество() > 0 Тогда
		
		МассивКА = Новый Массив;
		
		Для каждого Стр Из Объект.ВыделенныеКонтрагенты Цикл
			МассивКА.Добавить(Стр.Значение);
		КонецЦикла;
		
		Запрос.УстановитьПараметр("МассивКА", МассивКА);
		
	КонецЕсли; 

    /////////////набор запросов-
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб			= Истина;
	ТабДок.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;

	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Основной");
	
	//заголовок+
	Область = Макет.ПолучитьОбласть("Заголовок");
	Область.Параметры.Заголовок = "Финансовые показатели по управляемым объектам за "+ Месяц;
	Область.Параметры.ИК = "Объект "+Объект.ИК;

	ТабДок.Вывести(Область);
	//заголовок-
	
	ВыделяемКА = Ложь;
	Если Объект.ВыделятьКредиторов Или Объект.ВыделенныеКонтрагенты.Количество() > 0 Тогда
		ВыделяемКА = Истина;
	Иначе
		
		ЗапросГруппировка = СтрЗаменить(ЗапросГруппировка,
		"ГДЕ
		|	(НЕ ДетальныеЗаписи.Контрагент В (&МассивКА)
		|			ИЛИ ДетальныеЗаписи.СуммаНачальныйОстаток < 0
		|			ИЛИ ДетальныеЗаписи.СуммаКонечныйОстаток < 0)", ""); 
		
		//ЗапросГруппировка = СтрЗаменить(ЗапросГруппировка, "ИЛИ ДетальныеЗаписи.СуммаКонечныйОстаток < 0)", "");
		//ЗапросГруппировка = СтрЗаменить(ЗапросГруппировка, "НЕ ДетальныеЗаписи.Контрагент В (&МассивКА)", ""); 
		
	КонецЕсли;
	
	Если Не Объект.ВыделятьКредиторов Тогда
		
		Если ВыделяемКА Тогда
			ЗапросПоКонкретным = СтрЗаменить(ЗапросПоКонкретным, "ИЛИ (ДетальныеЗаписи.СуммаНачальныйОстаток > 0", ""); 
			ЗапросПоКонкретным = СтрЗаменить(ЗапросПоКонкретным, "ИЛИ ДетальныеЗаписи.СуммаКонечныйОстаток > 0)", ""); 
		КонецЕсли;
		
		ЗапросГруппировка = СтрЗаменить(ЗапросГруппировка, "ИЛИ ДетальныеЗаписи.СуммаНачальныйОстаток < 0", ""); 
		ЗапросГруппировка = СтрЗаменить(ЗапросГруппировка, "ИЛИ ДетальныеЗаписи.СуммаКонечныйОстаток < 0", ""); 
	
	КонецЕсли; 
	
	Если Объект.ВыделенныеКонтрагенты.Количество() = 0  Тогда
		
		Если ВыделяемКА Тогда
			ЗапросПоКонкретным = СтрЗаменить(ЗапросПоКонкретным, "ДетальныеЗаписи.Контрагент В (&МассивКА)", "Ложь");
		КонецЕсли;
		ЗапросГруппировка = СтрЗаменить(ЗапросГруппировка, "НЕ ДетальныеЗаписи.Контрагент В (&МассивКА)", "Ложь");
		
	КонецЕсли;	
	
	ИтогоНачислено = 0;
	ИтогоОплачено = 0;
	ИтогоДолг = 0;
	ИтогоДолгНаНачало = 0;
	
	Если ВыделяемКА Тогда //выделенные контрагенты+
		
		Запрос.Текст = ОсновнойЗапрос + Символы.ПС + ЗапросДетализацияВоВремТаблицу + Символы.ПС + ЗапросПоКонкретным; 
		
		РЗ = Запрос.Выполнить().Выбрать();
		
		Пока РЗ.Следующий() Цикл
			
			Область = Макет.ПолучитьОбласть("АрендаторСводнаяТЧ");
			Область.Параметры.АрендаторСводнойТЧ = РЗ.Контрагент;
			ТабДок.Вывести(Область);
			
			Область = Макет.ПолучитьОбласть("ШапкаСводнойТЧ");
			ТабДок.Вывести(Область);  
			
			Область = Макет.ПолучитьОбласть("СтрокаСводнойТЧ");
			ЗаполнитьЗначенияСвойств(Область.Параметры, РЗ); 
			ТабДок.Вывести(Область);
			
			
			Область = Макет.ПолучитьОбласть("ИтогоСводнойТЧ");
			
			Начислено = РЗ.ПениНачислено + РЗ.Перем + РЗ.Пост + РЗ.КУ + РЗ.НачислениеДепозита;  //нет депозита!!
			Оплачено = РЗ.ОплатаПени + РЗ.ОплатаДепозита + РЗ.СуммаРасход;
			Задолженность = РЗ.СуммаКонечныйОстаток + РЗ.ДепозитНаКонец + РЗ.ПениНаКонецПоБУ;
			Процент = (?(Начислено <> 0, Оплачено/Начислено, 0))*100;
			
			Область.Параметры.ИтогоНачислено = Начислено;
			Область.Параметры.ИтогоОплачено = Оплачено;
			Область.Параметры.ИтогоДолгНаКонец = Задолженность;
			Область.Параметры.Процент =  Строка(Окр(Процент, 2))+ "%";;
			
			ТабДок.Вывести(Область);
			
			ИтогоНачислено = ИтогоНачислено + Начислено;
			ИтогоОплачено = ИтогоОплачено + Оплачено;
			ИтогоДолг = ИтогоДолг + Задолженность;
			
			ИтогоДолгНаНачало = ИтогоДолгНаНачало + РЗ.СуммаНачальныйОстаток + РЗ.ДепозитНаНачало + РЗ.ПениНаНачалоПоБУ;
			
		КонецЦикла;	
		
		Область = Макет.ПолучитьОбласть("АрендаторСводнаяТЧ");
		Область.Параметры.АрендаторСводнойТЧ = "Остальные арендаторы";
		ТабДок.Вывести(Область);
		
	КонецЕсли; //выделенные контрагенты-
	
	//группировка+
	Запрос.Текст = ОсновнойЗапрос + Символы.ПС + ЗапросДетализацияВоВремТаблицу + Символы.ПС + ЗапросГруппировка;
	РЗ = Запрос.Выполнить().Выбрать();
	
	Пока РЗ.Следующий() Цикл
		
		Если РЗ.СуммаКонечныйОстаток = Null Тогда
		
			Продолжить; // + NAI Becar Конюшок С.Н. от 26.04.2017 02:22  заглушка, придумать лучше, срабатывает, когдадля группировки не отбирается никого
		
		КонецЕсли; 
		
		Область = Макет.ПолучитьОбласть("ШапкаСводнойТЧ");
		ТабДок.Вывести(Область);  
		
		Область = Макет.ПолучитьОбласть("СтрокаСводнойТЧ");
		ЗаполнитьЗначенияСвойств(Область.Параметры, РЗ); 
		ТабДок.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("ИтогоСводнойТЧ");
		
		Начислено = РЗ.ПениНачислено + РЗ.Перем + РЗ.Пост + РЗ.КУ + РЗ.НачислениеДепозита;  
		Оплачено = РЗ.ОплатаПени + РЗ.ОплатаДепозита + РЗ.СуммаРасход;
		Задолженность = РЗ.СуммаКонечныйОстаток + РЗ.ДепозитНаКонец + РЗ.ПениНаКонецПоБУ;
		
		Область.Параметры.ИтогоНачислено = Начислено;
		Область.Параметры.ИтогоОплачено = Оплачено;
		Область.Параметры.ИтогоДолгНаКонец = Задолженность;

		Процент = (?(Область.Параметры.ИтогоНачислено <> 0, Область.Параметры.ИтогоОплачено/Область.Параметры.ИтогоНачислено, 0))*100;
		Область.Параметры.Процент = Строка(Окр(Процент, 2))+ "%";
		
		ТабДок.Вывести(Область);
		
		Если ВыделяемКА Тогда
			Область = Макет.ПолучитьОбласть("ОбщийИтогСводнойТЧ");
			
			Область.Параметры.ИтогоДолгНаНачало = ИтогоДолгНаНачало + РЗ.СуммаНачальныйОстаток + РЗ.ДепозитНаНачало + РЗ.ПениНаНачалоПоБУ;
			
			Область.Параметры.ИтогоНачислено = Начислено + ИтогоНачислено;
			Область.Параметры.ИтогоОплачено = Оплачено + ИтогоОплачено;
			Область.Параметры.ИтогоДолгНаКонец = Задолженность + ИтогоДолг;
			
			//ИтогоНачислено = ИтогоНачислено + Начислено;
			//ИтогоОплачено = ИтогоОплачено + Оплачено;
			//ИтогоДолг = ИтогоДолг + Задолженность;
			
			Процент = (?(Область.Параметры.ИтогоНачислено <> 0, Область.Параметры.ИтогоОплачено/Область.Параметры.ИтогоНачислено, 0))*100;
			
			Область.Параметры.Процент = Строка(Окр(Процент, 2))+ "%";
			
			ТабДок.Вывести(Область);
		КонецЕсли;
		
		ИтогоНачислено = ИтогоНачислено + Начислено;
		ИтогоОплачено = ИтогоОплачено + Оплачено;
		ИтогоДолг = ИтогоДолг + Задолженность;
		
	КонецЦикла;
	//группировка-
	
	//площади+
	Запрос.Текст = ЗапросПлощади;
	РЗ = Запрос.Выполнить().Выбрать();
	
	Если РЗ.Следующий() Тогда
		
		Область = Макет.ПолучитьОбласть("ТЧПлощади");
		Область.Параметры.ОбщаяП = Объект.ИК.ЗначениеХарактеристики;
		Область.Параметры.АП = Объект.ИК.АП;
		Область.Параметры.Сдано = РЗ.ПлощадьСданных;
		Область.Параметры.Свободно = Объект.ИК.АП - РЗ.ПлощадьСданных;
		Область.Параметры.Заполнение = ?(Объект.ИК.АП=0,0,Строка(Окр(((РЗ.ПлощадьСданных /Объект.ИК.АП)*100),2))+"%"); 
		Область.Параметры.СданоЗаОтчПериод = РЗ.ПлощадьСданыхЗаОтчПериод;
		
		//ЗаполнитьЗначенияСвойств(Область.Параметры, РЗ); 
		ТабДок.Вывести(Область);
		
	КонецЕсли; 
	//площади-
	
	
	
	Запрос.Текст = ОсновнойЗапрос + Символы.ПС + СтрЗаменить(ЗапросДетализацияВоВремТаблицу, "ПОМЕСТИТЬ ДетальныеЗаписи", "");
	РЗ = Запрос.Выполнить().Выбрать();
	
	Область = Макет.ПолучитьОбласть("ШапкаДетализация");
	ТабДок.Вывести(Область);
	
	ТЗЗадолженностей = Новый ТаблицаЗначений;
	ТЗЗадолженностей.Колонки.Добавить("Основание");
	ТЗЗадолженностей.Колонки.Добавить("Сумма");
	
	Пока РЗ.Следующий() Цикл
		
		Если РЗ.СуммаКонечныйОстаток <> 0 Тогда
			НСтр = ТЗЗадолженностей.Добавить();
			НСтр.Основание = "Арендная плата";
			НСтр.Сумма = РЗ.СуммаКонечныйОстаток;
		КонецЕсли;	
			
		Если РЗ.ПениНаКонецПоБУ <> 0 Тогда
			НСтр = ТЗЗадолженностей.Добавить();
			НСтр.Основание = "Пени";
			НСтр.Сумма = РЗ.ПениНаКонецПоБУ;
		КонецЕсли;	
			
		Если РЗ.ДепозитНаКонец <> 0 и РЗ.ДепозитНаКонец <> null Тогда
			НСтр = ТЗЗадолженностей.Добавить();
			НСтр.Основание = "Депозит";
			НСтр.Сумма = РЗ.ДепозитНаКонец;
		КонецЕсли;
		
		Если ТЗЗадолженностей.Количество() = 1 Тогда
			
			Область = Макет.ПолучитьОбласть("Строка1Детализация");
			Область.Параметры.Основание1 = ТЗЗадолженностей[0].Основание; 
			Область.Параметры.Сумма1 = ТЗЗадолженностей[0].Сумма; 
			Область.Параметры.Контрагент = РЗ.Контрагент;
			
			ТабДок.Вывести(Область);
			
		ИначеЕсли ТЗЗадолженностей.Количество() = 2 Тогда
			Область = Макет.ПолучитьОбласть("Строка2Детализация");
			
			Область.Параметры.Основание1 = ТЗЗадолженностей[0].Основание; 
			Область.Параметры.Сумма1 = ТЗЗадолженностей[0].Сумма; 
			
			Область.Параметры.Основание2 = ТЗЗадолженностей[1].Основание; 
			Область.Параметры.Сумма2 = ТЗЗадолженностей[1].Сумма;
			
			Область.Параметры.Контрагент = РЗ.Контрагент;
			
			ТабДок.Вывести(Область);
			
		ИначеЕсли ТЗЗадолженностей.Количество() = 3 Тогда
			Область = Макет.ПолучитьОбласть("Строка3Детализация");
			
			Область.Параметры.Основание1 = ТЗЗадолженностей[0].Основание; 
			Область.Параметры.Сумма1 = ТЗЗадолженностей[0].Сумма; 
			
			Область.Параметры.Основание2 = ТЗЗадолженностей[1].Основание; 
			Область.Параметры.Сумма2 = ТЗЗадолженностей[1].Сумма; 
			
			Область.Параметры.Основание3 = ТЗЗадолженностей[2].Основание; 
			Область.Параметры.Сумма3 = ТЗЗадолженностей[2].Сумма; 
			
			Область.Параметры.Контрагент = РЗ.Контрагент;
			
			ТабДок.Вывести(Область);
			
		КонецЕсли;
		
		ТЗЗадолженностей.Очистить();
		
	КонецЦикла;
	
	Область = Макет.ПолучитьОбласть("ИтогДетализация");	
	Область.Параметры.Сумма = ИтогоДолг;
	ТабДок.Вывести(Область);
	
	Объект.Таблица = ТабДок;
	
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	//ВыборПериодаКлиент.ПериодНачалоВыбора(ЭтаФорма, Элемент, СтандартнаяОбработка, 
	//Объект.ВидПериода, Месяц, Объект.НачалоПериода, Объект.ОкончаниеПериода);
	
	////ВыборПериодаКлиент.ПериодНачалоВыбора(ЭтаФорма, Элемент, СтандартнаяОбработка, 
	////ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц"), Месяц, Объект.НачалоПериода, Объект.ОкончаниеПериода);

	
КонецПроцедуры

&НаКлиенте
Процедура МесяцАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПериодНачалоВыбора(ЭтаФорма, Элемент, СтандартнаяОбработка, 
	ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц"), Месяц, Объект.НачалоПериода, Объект.ОкончаниеПериода);
	
	Текст = Месяц;
	//Возврат;
	//Объект.НачалоПериода
	//Объект.ОкончаниеПериода = КонецМесяца(Объект.НачалоПериода); //-са
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачалоВыбора(Форма, Элемент, СтандартнаяОбработка, ВидПериода, Период, НачалоПериода, КонецПериода) Экспорт
	
	Если НачалоПериода = '00010101' Тогда
		НачалоПериода = ВыборПериодаКлиентСервер.НачалоПериодаОтчета(ВидПериода, ТекущаяДата());
	КонецЕсли;
	
	ВыбранныйПериод      = ВыбратьПериодОтчета(Форма, Элемент, СтандартнаяОбработка, ВидПериода, НачалоПериода);
	СтандартнаяОбработка = Ложь;
	Если ВыбранныйПериод = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Период = ВыбранныйПериод.Представление;
	
	НачалоПериода = ВыбранныйПериод.Значение;
	КонецПериода  = КонецМесяца(ВыбранныйПериод.Значение);

	
КонецПроцедуры

&НаКлиенте
Функция ВыбратьПериодОтчета(Форма, Элемент, СтандартнаяОбработка, ВидПериода, НачалоПериода)
	
	Список = ВыборПериодаКлиентСервер.ПолучитьСписокПериодов(НачалоПериода, ВидПериода);
	Если Список.Количество() = 0 Тогда
		СтандартнаяОбработка = Ложь;
		Возврат Неопределено;
	КонецЕсли;
	
	ЭлементСписка = Список.НайтиПоЗначению(НачалоПериода);
	ВыбранныйПериод = Форма.ВыбратьИзСписка(Список, Элемент, ЭлементСписка);
	
	Если ВыбранныйПериод = Неопределено тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Индекс = Список.Индекс(ВыбранныйПериод);
	Если Индекс = 0 ИЛИ Индекс = Список.Количество() - 1 тогда
		ВыбранныйПериод = ВыбратьПериодОтчета(Форма, Элемент, СтандартнаяОбработка, ВидПериода, ВыбранныйПериод.Значение);
	КонецЕсли;
	
	Возврат ВыбранныйПериод;
	
КонецФункции

&НаКлиенте
Процедура МесяцОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура МесяцОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура МесяцПриИзменении(Элемент)
	//СтандартнаяОбработка = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ИКНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыВыбора1 = Новый Массив;//(Элемент.ПараметрыВыбора);
	НовыйПараметр = Новый ПараметрВыбора("ТипОбъекта", ПредопределенноеЗначение("Справочник.АР_ТипыОбъектовАренды.ИмущественныйКомплекс"));
	ПараметрыВыбора1.Очистить();
	ПараметрыВыбора1.Добавить(НовыйПараметр);
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора1);

КонецПроцедуры



//"ВЫБРАТЬ
//	|	АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента КАК ДоговорКонтрагента,
//	|	АР17_ЗаключениеДоговораАренды.Контрагент,
//	|	АР17_ЗаключениеДоговораАренды.СуммаЗалога
//	|ПОМЕСТИТЬ Договоры
//	|ИЗ
//	|	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
//	|ГДЕ
//	|	АР17_ЗаключениеДоговораАренды.Проведен
//	|	И АР17_ЗаключениеДоговораАренды.ИК = &ИК
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	ДоговорКонтрагента
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	АР_РасчетыПоДоговорамОстаткиИОбороты.СуммаНачальныйОстаток,
//	|	АР_РасчетыПоДоговорамОстаткиИОбороты.СуммаРасход,
//	|	АР_РасчетыПоДоговорамОстаткиИОбороты.СуммаКонечныйОстаток,
//	|	Договоры.ДоговорКонтрагента
//	|ПОМЕСТИТЬ ОстаткиИОплаты
//	|ИЗ
//	|	РегистрНакопления.АР_РасчетыПоДоговорам.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Месяц, , ) КАК АР_РасчетыПоДоговорамОстаткиИОбороты
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Договоры КАК Договоры
//	|		ПО АР_РасчетыПоДоговорамОстаткиИОбороты.ДоговорКонтрагента = Договоры.ДоговорКонтрагента
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	АР_РасчетыПоДоговорам.Регистратор КАК Регистратор,
//	|	Договоры.ДоговорКонтрагента
//	|ПОМЕСТИТЬ Реализации
//	|ИЗ
//	|	РегистрНакопления.АР_РасчетыПоДоговорам КАК АР_РасчетыПоДоговорам
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Договоры КАК Договоры
//	|		ПО АР_РасчетыПоДоговорам.ДоговорКонтрагента = Договоры.ДоговорКонтрагента
//	|ГДЕ
//	|	АР_РасчетыПоДоговорам.Период <= &КонецПериода
//	|	И АР_РасчетыПоДоговорам.Период >= &НачалоПериода
//	|	И АР_РасчетыПоДоговорам.ВидДвижения = &ВидДвиженияПриход
//	|	И ТИПЗНАЧЕНИЯ(АР_РасчетыПоДоговорам.Регистратор) = &ТипРТУ
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	Регистратор
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	РеализацияТоваровУслугУслуги.Сумма,
//	|	Реализации.ДоговорКонтрагента КАК ДоговорКонтрагента,
//	|	ВЫБОР
//	|		КОГДА РеализацияТоваровУслугУслуги.Номенклатура.АР_ПостояннаяЧастьОплаты
//	|			ТОГДА ""Пост""
//	|		ИНАЧЕ ВЫБОР
//	|				КОГДА РеализацияТоваровУслугУслуги.Номенклатура.АР_КоммунальныеУслуги
//	|					ТОГДА ""КУ""
//	|				ИНАЧЕ ""Перем""
//	|			КОНЕЦ
//	|	КОНЕЦ КАК ВидНоменклатуры
//	|ПОМЕСТИТЬ РеализованныеУслуги
//	|ИЗ
//	|	Реализации КАК Реализации
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
//	|		ПО Реализации.Регистратор = РеализацияТоваровУслугУслуги.Ссылка
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	РеализацияТоваровУслугАгентскиеУслуги.Сумма,
//	|	Реализации.ДоговорКонтрагента,
//	|	ВЫБОР
//	|		КОГДА РеализацияТоваровУслугАгентскиеУслуги.Номенклатура.АР_ПостояннаяЧастьОплаты
//	|			ТОГДА ""Пост""
//	|		ИНАЧЕ ВЫБОР
//	|				КОГДА РеализацияТоваровУслугАгентскиеУслуги.Номенклатура.АР_КоммунальныеУслуги
//	|					ТОГДА ""КУ""
//	|				ИНАЧЕ ""Перем""
//	|			КОНЕЦ
//	|	КОНЕЦ
//	|ИЗ
//	|	Реализации КАК Реализации
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
//	|		ПО Реализации.Регистратор = РеализацияТоваровУслугАгентскиеУслуги.Ссылка
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	ДоговорКонтрагента
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	РеализованныеУслуги.Сумма КАК Пост,
//	|	0 КАК Перем,
//	|	0 КАК Ку,
//	|	РеализованныеУслуги.ДоговорКонтрагента
//	|ПОМЕСТИТЬ РеализованныеУслуги1
//	|ИЗ
//	|	РеализованныеУслуги КАК РеализованныеУслуги
//	|ГДЕ
//	|	РеализованныеУслуги.ВидНоменклатуры = ""Пост""
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	0,
//	|	РеализованныеУслуги.Сумма,
//	|	0,
//	|	РеализованныеУслуги.ДоговорКонтрагента
//	|ИЗ
//	|	РеализованныеУслуги КАК РеализованныеУслуги
//	|ГДЕ
//	|	РеализованныеУслуги.ВидНоменклатуры = ""Перем""
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	0,
//	|	0,
//	|	РеализованныеУслуги.Сумма,
//	|	РеализованныеУслуги.ДоговорКонтрагента
//	|ИЗ
//	|	РеализованныеУслуги КАК РеализованныеУслуги
//	|ГДЕ
//	|	РеализованныеУслуги.ВидНоменклатуры = ""КУ""
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	РеализованныеУслуги1.ДоговорКонтрагента,
//	|	СУММА(РеализованныеУслуги1.Пост) КАК Пост,
//	|	СУММА(РеализованныеУслуги1.Перем) КАК Перем,
//	|	СУММА(РеализованныеУслуги1.Ку) КАК Ку
//	|ПОМЕСТИТЬ РеализованныеУслугиПоДоговору
//	|ИЗ
//	|	РеализованныеУслуги1 КАК РеализованныеУслуги1
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	РеализованныеУслуги1.ДоговорКонтрагента
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток КАК ДепозитНаНачалоПоБУ,
//	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт КАК ОплатаДепозита,
//	|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток КАК ДепозитНаКонецПоБУ,
//	|	ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Субконто2 КАК Справочник.ДоговорыКонтрагентов) КАК ДоговорКонтрагента
//	|ПОМЕСТИТЬ Депозиты
//	|ИЗ
//	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Месяц, , Счет.Код = ""62.04"", , ) КАК ХозрасчетныйОстаткиИОбороты
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Договоры КАК Договоры
//	|		ПО ХозрасчетныйОстаткиИОбороты.Субконто2 = Договоры.ДоговорКонтрагента
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток КАК ПениНаНачалоПоБУ,
//	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт КАК ОплатаПени,
//	|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток КАК ПениНаКонецПоБУ,
//	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт,
//	|	ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Субконто2 КАК Справочник.ДоговорыКонтрагентов) КАК ДоговорКонтрагента
//	|ПОМЕСТИТЬ Пени
//	|ИЗ
//	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Месяц, , Счет.Код = ""62.09"", , ) КАК ХозрасчетныйОстаткиИОбороты
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Договоры КАК Договоры
//	|		ПО ХозрасчетныйОстаткиИОбороты.Субконто2 = Договоры.ДоговорКонтрагента
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ЕСТЬNULL(Пени.ПениНаНачалоПоБУ, 0) КАК ПениНаНачалоПоБУ,
//	|	ЕСТЬNULL(Пени.ОплатаПени, 0) КАК ОплатаПени,
//	|	ЕСТЬNULL(Пени.ПениНаКонецПоБУ, 0) КАК ПениНаКонецПоБУ,
//	|	ЕСТЬNULL(Пени.СуммаОборотДт, 0) КАК ПениНачислено,
//	|	ЕСТЬNULL(РеализованныеУслугиПоДоговору.Пост, 0) КАК Пост,
//	|	ЕСТЬNULL(РеализованныеУслугиПоДоговору.Перем, 0) КАК Перем,
//	|	ЕСТЬNULL(РеализованныеУслугиПоДоговору.Ку, 0) КАК КУ,
//	|	ЕСТЬNULL(ОстаткиИОплаты.СуммаНачальныйОстаток, 0) КАК СуммаНачальныйОстаток,
//	|	ЕСТЬNULL(ОстаткиИОплаты.СуммаРасход, 0) КАК СуммаРасход,
//	|	ЕСТЬNULL(ОстаткиИОплаты.СуммаКонечныйОстаток, 0) КАК СуммаКонечныйОстаток,
//	|	ЕСТЬNULL(Депозиты.ДепозитНаНачалоПоБУ, 0) + Договоры.СуммаЗалога КАК ДепозитНаНачало,
//	|	ЕСТЬNULL(Депозиты.ОплатаДепозита, 0) КАК ОплатаДепозита,
//	|	ЕСТЬNULL(Депозиты.ДепозитНаКонецПоБУ, 0) + Договоры.СуммаЗалога КАК ДепозитНаКонец,
//	|	Договоры.СуммаЗалога,
//	|	Договоры.ДоговорКонтрагента КАК ДоговорКонтрагента,
//	|	Договоры.Контрагент
//	|ИЗ
//	|	Договоры КАК Договоры
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиИОплаты КАК ОстаткиИОплаты
//	|		ПО Договоры.ДоговорКонтрагента = ОстаткиИОплаты.ДоговорКонтрагента
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РеализованныеУслугиПоДоговору КАК РеализованныеУслугиПоДоговору
//	|		ПО Договоры.ДоговорКонтрагента = РеализованныеУслугиПоДоговору.ДоговорКонтрагента
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Депозиты КАК Депозиты
//	|		ПО Договоры.ДоговорКонтрагента = Депозиты.ДоговорКонтрагента
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Пени КАК Пени
//	|		ПО Договоры.ДоговорКонтрагента = Пени.ДоговорКонтрагента
